//------------------------------------------------------------------------------
// triangle.cpp - содержит функции обработки треугольника
//------------------------------------------------------------------------------

#include <math.h>
#include "triangle.h"
#include "colour.h"

//------------------------------------------------------------------------------
// Ввод параметров треугольника из потока
void Triangle::In(ifstream &ifst) {
    ifst >> ax >> ay >> bx >> by >> cx >> cy >> c;
}

//------------------------------------------------------------------------------
// Вывод параметров треугольника в поток
void Triangle::Out(ofstream &ofst) {
    ofst << "It is a " << GetColour(c) << " Triangle: a.x = " << ax << ", a.y = " << ay <<
         ", b.x = " << bx << ", b.y = " << by << ", c.x = " << cx << ", c.y = " << cy << "\n";
}

//------------------------------------------------------------------------------
// Вычисление площади треугольника
double Triangle::Area() {
    return (double) fabs((bx - ax) * (cy - ay) - (cx - ax) * (by - ay)) / 2;
}
