#ifndef __circle__
#define __circle__

//------------------------------------------------------------------------------
// circle.h - содержит описание оркужности и ее интерфейса
//------------------------------------------------------------------------------

#include <fstream>

// Окружность
struct circle {
    int x; // x координата центра
    int y; // y координата центра
    int r; // Радиус
    int c; // Цвет
};

// Ввод параметров окружности из файла
void In(circle &r, std::ifstream &ifst);

// Вывод параметров окружности в форматируемый поток
void Out(circle &r, std::ofstream &ofst);

// Вычисление площади окружности
double Area(circle &r);

#endif //__circle__
