//------------------------------------------------------------------------------
// rectangle_In.cpp - содержит процедуру ввода параметров
// для уже созданного прямоугольника
//------------------------------------------------------------------------------

#include "rectangle.h"
#include "colour.h"

//------------------------------------------------------------------------------
// Ввод параметров прямоугольника из файла
void In(rectangle &r, std::ifstream &ifst) {
    ifst >> r.ax >> r.ay >> r.bx >> r.by >> r.c;
}

//------------------------------------------------------------------------------
// Вывод параметров прямоугольника в форматируемый поток
void Out(rectangle &r, std::ofstream &ofst) {
    ofst << "It is a " << GetColour(r.c) << " Rectangle: a.x = " << r.ax << ", a.y = " << r.ay <<
         ", b.x = " << r.bx << ", b.y = " << r.by << "\n";
}

//------------------------------------------------------------------------------
// Вычисление площади прямоугольника
double Area(rectangle &r) {
    return (r.bx - r.ax) * (r.ay - r.by);
}
