//------------------------------------------------------------------------------
// triangle.cpp - содержит функции обработки треугольника
//------------------------------------------------------------------------------

#include <math.h>
#include "triangle.h"
#include "colour.h"

//------------------------------------------------------------------------------
// Ввод параметров треугольника из потока
void In(triangle &t, std::ifstream &ifst) {
    ifst >> t.ax >> t.ay >> t.bx >> t.by >> t.cx >> t.cy >> t.c;
}

//------------------------------------------------------------------------------
// Вывод параметров треугольника в поток
void Out(triangle &t, std::ofstream &ofst) {
    ofst << "It is a " << GetColour(t.c) << " Triangle: a.x = " << t.ax << ", a.y = " << t.ay <<
         ", b.x = " << t.bx << ", b.y = " << t.by << ", c.x = " << t.cx << ", c.y = " << t.cy << "\n";
}

//------------------------------------------------------------------------------
// Вычисление площади треугольника
double Area(triangle &t) {
    return (double) fabs((t.bx - t.ax) * (t.cy - t.ay) - (t.cx - t.ax) * (t.by - t.ay)) / 2;
}
