#ifndef __triangle__
#define __triangle__

//------------------------------------------------------------------------------
// triangle.h - содержит описание треугольника
//------------------------------------------------------------------------------

#include <fstream>

//------------------------------------------------------------------------------
// треугольник
struct triangle {
    int ax, ay; // коорднаты x и y 1-го угла
    int bx, by; // коорднаты x и y 2-го угла
    int cx, cy; // коорднаты x и y 3-го угла
    int c; // цвет
};

// Ввод параметров треугольника из файла
void In(triangle &t, std::ifstream &ifst);

// Вывод параметров треугольника в форматируемый поток
void Out(triangle &t, std::ofstream &ofst);

// Вычисление площади треугольника
double Area(triangle &t);

#endif //__triangle__
