//------------------------------------------------------------------------------
// circle_In.cpp - содержит процедуру ввода параметров
// для уже созданного круга
//------------------------------------------------------------------------------

#define _USE_MATH_DEFINES
#include <math.h>
#include "circle.h"
#include "colour.h"
#include <iostream>

//------------------------------------------------------------------------------

// Ввод параметров круга из файла
void In(circle &c, std::ifstream &ifst) {
    ifst >> c.r >> c.x >> c.y >> c.c;
}

//------------------------------------------------------------------------------
// Вывод параметров круга в форматируемый поток
void Out(circle &c, std::ofstream &ofst) {
    ofst << "It is a " << GetColour(c.c) << " Circle: r = " << c.r << ", O.x = " << c.x <<
         ", O.y = " << c.y << "\n";
}

//------------------------------------------------------------------------------
// Вычисление площади круга
double Area(circle &c) {
    return M_PI * c.r * c.r;
}
